{
  "primary": "## Primary\n\nThis colour is reserved for the main CTA on a page, like adding or importing. Wherever possible, there should only be one Primary coloured action on a page, dialog, or sheet.",
  "success": "## Success\n\nThis colour is used to indicate positive items, like Save or Accept buttons or Completed indicators. It reinforces that the action or status is of a positive nature. For example, a message confirming that an import was performed successfully would use the Success colour.",
  "danger": "## Danger\n\nThis colour is used to indicate information about destructive activities or to validate form completion, where failure to take or avoid a specific action could result in the loss of data or the inability to submit a form. It should be clear to users that disregarding such a message may not be reversible, or that without correct form validation users must make the necessary changes to continue.",
  "info": "## Info\n\nThis colour is used to indicate neutral or advisory information, which provide details that either apply to regular day-to-day usage or relates to special conditions. Users can ignore this context with no impact. For example, a message recommending the size for images before importing.",
  "greyscale_colours": "## Greyscale colours\n\nThe greyscale palette is our base palette and used for the default font colours and most UI elements, such as borders, dividers, surface backgrounds, etc. It comprises of 14 colours, including black and white. This provides an extremely flexible palette to work with:",
  "contextual_colours": "## Contextual colours\n\nThe contextual colours are used to support specific actions, statuses, or outcomes. They provide an additional layer of visual information to help users understand how a product has interpreted a decision, or to indicate how something will be interpreted. For example, an invalid input on a form would use the 'danger' contextual colour to indicate an error. However, contextual colours must always be accompanied by text labels or icons (or both!), as colour alone will not be conveyed to all users. For more information, please refer to [Accessibility](/guidelines/accessibility).\n\nOur contextual colours are named:\n\n* **Primary**\n* **Success**\n* **Danger**\n* **Warning**\n* **Info**\n",
  "warning": "## Warning\n\nThis colour is used to indicate information recommended for the completion of a task, which may require confirmation or a particular course of action. Users should be allowed to ignore warnings and still complete a task, but it must be made clear that doing so may have a negative impact. For example, a message warning that a file is bigger than the recommended size and may affect performance."
}